{
  "name": "João Nascimento",
  "nickname": "The Code Invoker",
  "race": {
    "species": {
      "primary": "Human",
      "effects": [
        "+1 to two Attributes of your choice",
        "You gain Proficiency in one skill of your choice"
      ],
      "description": "Humans are a blank slate, they can be anything they want to be."
    },
    "ethnicity": {
      "primary": "Brazilian",
      "effects": [
        "You gain Proficiency on Wisdom Saving Throws",
        "+1 Charisma",
        "You max the Portuguese language",
        "You gain 2 points in the Spanish language"
      ],
      "description": "In living in a country full of chaos, inefficiencies and conflicting ideas, Brazilians have developed a resilient mind and a way to carry on with their lives with humor and a good laugh in the face of adversity."
    },
    "archetype": {
      "primary": "Carioca",
      "effects": [
        "You gain Proficiency in Perception",
        "+1 Dexterity",
        "Resistance to Fire Damage",
        "Weakness to Cold Damage"
      ],
      "description": "Rio's violence creates almost a paranoid awareness of your surroundings, granting enhanced agility and defense reflexes.\n\nThe scorching heat of the city builds natural resistance to fire damage, while the lack of cold exposure makes you vulnerable to freezing temperatures."
    }
  },
  "birthDate": "1997-02-17",
  "experience": {
    "campaignStartDate": "2021-05-10",
    "experienceDescriptions": {
      "1": "A fledgling Code Initiate, you have just begun your journey into the arcane arts of programming. You still need guidance in all but the simplest of rituals, but your potential is boundless.",
      "5": "An Acolyte of the arcane arts of programming. You have the autonomy operate on others' rituals mostly unguided, but you still lack the ability to concoct your own. You excel best as a cog in the machine.",
      "10": "A Code Adept with considerable power at your fingertips. You can craft sophisticated applications, solve problems creatively and guide the younger in their rituals. Your runes are a thing of beauty, but you still lack the ability to create impact at scale.",
      "15": "An Archengineer whose mastery of the programming arts abounds and overflows. You can architect entire systems, lead teams of fellow casters, and your debugging prowess borders on divination. At this level you can masterly and effortlessly mimic, improve and create rituals of your own.",
      "20": "You're truly a legend. You can not only create entire systems, but acquire the wisdom to know which systems to create and why. You command entire armies of casters and have the influence the very runes with which to write."
    },
    "attributeLeveling": [4, 8, 12, 16],
    "proficiencyBonus": [
      2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5, 6, 6, 6, 6
    ]
  },
  "mainClass": {
    "name": "Software Engineer",
    "subclass": {
      "name": "Full Stack",
      "description": "Full Stack Software Engineers are the most versatile and well-rounded of all Software Engineers, knowledgeable in many of the different arcane arts of Software Development. \n\nHowever, their abilities fall short when it comes to design full-fledged complex systems operating at scale.\n\nThey're an excellent choice for small teams or teams that work on many different projects of lower complexity.",
      "effects": [
        "Choose 1 skill proficiency between: Continuous Learning, Intuition and Effective Communication",
        "For all these features, you can go up to level 3, if you haven't reached that level already: Backend Programming Language, Frontend Programming Language, SQL Fundamentals, Git, Cloud Platform."
      ]
    },
    "description": "Software Engineers bend reality by writing runes in a strange language over electrified rocks.\n\nTheir drink of choice for these long rituals is coffee, that has potentially dangerous effects on the uninitiated, but a fuel in the mouth of these conjurers. Their minds are forged by endless debugging and their bodies are hardened by prolonged sitting sessions.\n\nThis Class gives little attention to armor and use little more than the most basic they can get away with. They generally wield Laptops as their weapon of choice, opting for Desktop PCs for bulkier builds. Inumerous builds are possible, leveraging a wide range of skills, from analytical, to creative and interpersonal.",
    "effects": [
      "Hit Die: d8",
      "You gain the Feature: Caffeine Reservoir",
      "You gain Proficiency on Intelligence Saving Throws",
      "You gain Proficiency in Light Armor",
      "You gain Proficiency in Laptops and Desktop PCs",
      "Choose 3 skill proficiencies between: Analytical Reasoning, Continuous Learning, Leadership, Attention to Detail, Artistic Expression and Strategic Planning.",
      "Subclass: Choose at Level 3 - Frontend, Backend, Full Stack, DevOps, Mobile, Embedded Systems, OS Development, Game Development, ML/AI or Engineering Management"
    ]
  },
  "portrait": "/placeholder.svg",
  "languages": [
    {
      "name": "Portuguese",
      "level": 7,
      "cefrLevel": "Native"
    },
    {
      "name": "English",
      "level": 6,
      "cefrLevel": "C2",
      "description": "Certified by the Imperial League of English Testing Scholars (IELTS) - Band 8.5 | CEFR C2 equivalent, credential 23BR000122BATJ705G"
    },
    {
      "name": "French",
      "level": 5,
      "cefrLevel": "C1",
      "description": "Certified by the Tribunal de Compétence Française (TCF) - CEFR C1, CREDENTIAL ID: 8D2CAB511C9D"
    },
    {
      "name": "German",
      "level": 4,
      "cefrLevel": "B2",
      "underusageDebuff": {
        "active": true,
        "description": "Underusage puts the user two levels of proficiency below its current, until he spends some time in the language to regain level."
      }
    },
    {
      "name": "Spanish",
      "level": 2,
      "cefrLevel": "A2",
      "description": "Can read basic and intermediate texts due to similarity with Portuguese.",
      "underusageDebuff": {
        "active": true,
        "description": "Underusage puts the user two levels of proficiency below its current, until he spends some time in the language to regain level."
      }
    }
  ],
  "immunities": ["Short-Sightedness"],
  "resistances": ["Fire Damage"],
  "weaknesses": ["Cold Damage"],
  "weaponProficiencies": ["Laptops", "Desktop PCs"],
  "equipmentProficiencies": ["Light Armor"],
  "biography": {
    "appearance": {
      "sex": "Male",
      "hair": "Black and wavy, shoulder-length",
      "eyes": "Black",
      "skin": "Light brown",
      "height": "1.66m",
      "weight": "64kg",
      "age": "28 years"
    },
    "alignment": {
      "type": "True Neutral",
      "description": "You have no firm convictions, you're skeptical of any strong ideologies, and wary of the classifications like good and evil. You're a pragmatist, balancing your deeds according to the circumstances."
    },
    "faith": {
      "name": "Atheism",
      "description": "You don't believe in deities, afterlife or any supernatural forces."
    },
    "personalityTraits": ["Curious", "Organized", "Independent", "Sarcastic"],
    "moralStandings": {
      "ideals": [
        "The only thing better than writing code is deleting it",
        "I don't deal in absolutes, everything is circumstantial"
      ],
      "bonds": [
        "Spending time onboarding new people and helping juniors pays compounding interest",
        "Code is to be written with empathy, it must make someone's life better"
      ],
      "flaws": [
        "Sometimes I get lost in the details that are not so relevant to the problem at hand",
        "The more I have to do, the more likely I am to procrastinate"
      ]
    },
    "lore": "To me, writing code is not only a income source or a means to solve problems, but an exertion of my will to create, and to contemplate the beauty in representing an idea in its most reduced form."
  },
  "skills": [
    {
      "name": "Perception",
      "description": "Quickly noticing patterns, detecting changes in environment, and identifying what differs from the usual",
      "attribute": "wisdom",
      "proficient": true,
      "otherBonusSources": {
        "Weapon": 1
      }
    },
    {
      "name": "Intuition",
      "description": "Trusting gut instincts, making decisions with incomplete information, and suspending disbelief when facing the unknown",
      "attribute": "wisdom",
      "proficient": false
    },
    {
      "name": "Analytical Reasoning",
      "description": "Gathering information, analyzing data, questioning assumptions, and solving complex problems through research and logical thinking",
      "attribute": "intelligence",
      "proficient": true
    },
    {
      "name": "Persuasion",
      "description": "Ability to influence others through logical arguments, emotional appeals, and negotiation",
      "attribute": "charisma",
      "proficient": false
    },
    {
      "name": "Effective Communication",
      "description": "Understanding people's motives, communicating effectively, and building meaningful relationships",
      "attribute": "charisma",
      "proficient": true
    },
    {
      "name": "Continuous Learning",
      "description": "Staying current with technology trends, learning new tools and frameworks, and adapting to industry changes",
      "attribute": "intelligence",
      "proficient": true,
      "otherBonusSources": {
        "Weapon": 1
      }
    },
    {
      "name": "Artistic Expression",
      "description": "Creating beauty, expressing ideas through art, and appreciating aesthetic value in various forms",
      "attribute": "intelligence",
      "proficient": false
    },
    {
      "name": "Risk Taking",
      "description": "Embracing uncertainty, making bold decisions, and pursuing opportunities despite potential failure",
      "attribute": "wisdom",
      "proficient": false
    },
    {
      "name": "Strategic Planning",
      "description": "Creating long-term plans, designing systems, and managing complex projects with foresight",
      "attribute": "intelligence",
      "proficient": true
    },
    {
      "name": "Leadership",
      "description": "Inspiring and guiding others, making decisions, and taking responsibility for outcomes",
      "attribute": "charisma",
      "proficient": false
    },
    {
      "name": "Empathy",
      "description": "Understanding and sharing the feelings of others, building rapport and trust",
      "attribute": "charisma",
      "proficient": false
    },
    {
      "name": "Attention to Detail",
      "description": "Noticing small errors, maintaining quality standards, and ensuring accuracy",
      "attribute": "wisdom",
      "proficient": true
    },
    {
      "name": "Physical Endurance",
      "description": "Maintaining energy and focus during long work sessions, handling physical demands",
      "attribute": "strength",
      "proficient": false
    },
    {
      "name": "Manual Precision",
      "description": "Performing precise physical tasks, fine motor control, and delicate operations",
      "attribute": "dexterity",
      "proficient": false
    },
    {
      "name": "Physical Coordination",
      "description": "Moving efficiently in workspace and handling equipment",
      "attribute": "dexterity",
      "proficient": false
    },
    {
      "name": "Stress Management",
      "description": "Maintaining composure under pressure, managing emotions, and staying focused",
      "attribute": "wisdom",
      "proficient": false,
      "otherBonusSources": {
        "Weapon": -1
      }
    },
    {
      "name": "Networking",
      "description": "Building professional relationships, expanding contacts, and leveraging connections",
      "attribute": "charisma",
      "proficient": false
    }
  ],
  "spells": [
    {
      "name": "Obsession",
      "description": "You become hyperfocused on a single problem or task, entering a state of deep concentration where time seems to slow and distractions fade away.",
      "recovery": "LR",
      "charges": {
        "max": 1,
        "current": 1
      },
      "icon": "🤯",
      "components": ["Social Isolation", "3 Mugs of Coffee"],
      "effects": [
        "@int_proficiency * 2 on Intelligence Skill checks and Saving Throws",
        "Perception checks are made with disadvantage",
        "@int_modifier * 2 on Intelligence modifier on attacks",
        "At the end of the spell, you must succeed on a Wisdom Saving Throw (DC 13) or suffer one level of exhaustion. If over the course of week you fail the Saving Throw 3 times, you gain the Burnout debuff."
      ],
      "duration": "6 hours"
    },
    {
      "name": "Caffeine Rush",
      "description": "A transmutation spell that channels the raw energy of caffeine into your bloodstream, temporarily enhancing your reflexes, mental acuity, and coding speed. Your fingers tap the keyboard with supernatural precision, and your mind processes information at a blazing fast speed. The effect is inversely proportional to the amount of coffee you already had this day.",
      "recovery": "LR",
      "charges": {
        "max": 3,
        "current": 3
      },
      "icon": "⚡",
      "components": ["1 Mug of Coffee"],
      "effects": [
        "@dex_proficiency + (3 - @coffee_drunk) to Dexterity",
        "@int_proficiency + (5 - @coffee_drunk) to Intelligence",
        "@coding_speed + (10 * (6 - @coffee_drunk)) to Coding Speed"
      ],
      "duration": "1 hour"
    },
    {
      "name": "Eagle Eyes",
      "description": "A divination spell that enhances your visual perception to superhuman levels, allowing you to spot bugs, inconsistencies, and optimization opportunities that would be invisible to the naked eye. Your eyes glow with a faint blue light as you scan through lines of code, skim through PRDs, review PRs and read Feature Requests.",
      "recovery": "SR",
      "charges": {
        "max": 2,
        "current": 2
      },
      "icon": "🦅",
      "effects": [
        "+5 to Perception checks",
        "+5 to Attention to Detail checks",
        "Bug-type monsters attack you with disadvantage"
      ],
      "duration": "1 hour",
      "components": ["Social Isolation", "1 Mug of Coffee"]
    }
  ],
  "features": [
    {
      "name": "Renaissance Man",
      "description": "You have dedicated yourself a great deal into learning from a wide range of disciplines, sacrificing depth in favor of breadth. You acquired knowledge that is both useful in daily situations, as well as transformative of your world view. Most importantly, you've learned how to learn, and to do it by yourself.",
      "effects": [
        "Languages: You've gained understanding about the English, French and German languages, as well as improved knowledge of language structures, grammar and philology.",
        "Chemistry: You have a graduation level knowledge of chemistry, in special analytical chemistry. Due to lack of use, this knowledge is latent.",
        "Chemical Engineering: You have a graduation level knowledge of chemical engineering, processes calculus, thermodynamics, kinetics, processes and so on. You have specialized knowledge in solvent extraction and the rare earth elements separation. Due to lack of use, this knowledge is latent.",
        "Investing and Accounting: You have had the opportunity to invest successfully in a wide class of assets, and assessing their quality, therewith learning the fundamentals of value investing, how to read financial statements, and how companies operate from the shareholder's perspective. By having to set up a company yourself and do its accounting, you've learned the basics of bookkeeping, invoice issuing, worker's pay, tax declaration and more.",
        "Geography and History: Your enthusiasm for learning about different cultures of different places at different times, has granted you an above average understanding about cultural heritage and current geopolitics."
      ],
      "icon": "🎨",
      "prerequisites": [],
      "locked": false,
      "treeData": { "x": 0, "y": 0 },
      "origin": "others"
    },
    {
      "name": "Caffeine Reservoir",
      "description": "You have drunk so much Coffee that your body has adapted to its effects, and even learned use it to power up its working, to the point that you've gained the ability to use this black brew to fuel your spells. You have a Coffee Reservoir from which you can drink throughout the day and is restored after a good night of sleep. Drinking too much before going to sleep will harm your sleep quality.",
      "effects": [
        "You gain a Caffeine Reservoir, that allows you to drink \"2 + @constitution_bonus + @level_bonus\" Mugs of Coffee per day",
        "You gain 1 point of @level_bonus to your Coffee Reservoir at levels 3, 7, 11, 15 and 19",
        "Drinking Coffee within 6 hours of a Long Rest will make it count as a Short Rest",
        "Your Coffee Reservoir is fully restored at a Long Rest"
      ],
      "icon": "☕",
      "prerequisites": [],
      "level": 0,
      "maxLevel": 0,
      "locked": false,
      "treeData": { "x": 0, "y": 0 },
      "origin": "class"
    },
    {
      "name": "Programming Fundamentals",
      "icon": "💻",
      "prerequisites": [],
      "level": 4,
      "maxLevel": 4,
      "levelsDescriptions": [
        "You learn a programming Language of your choice, between: Python, JavaScript, Java or C.\n\nYou learn the basics of programming, including variables, data types, control flow",
        "You learn the basics of I/O. You learn how a debugger and an IDE of your choice.",
        "You learn about basic algorithms and data structures; as well as memory and time complexity, and simple optimization strategies.",
        "You learn the basics of object-oriented programming and functional programming."
      ],
      "locked": false,
      "treeData": { "x": 0, "y": 0 },
      "origin": "class"
    },
    {
      "name": "Web Development Fundamentals",
      "description": "",
      "icon": "🕸️",
      "prerequisites": [{ "name": "Programming Fundamentals", "level": 3 }],
      "level": 6,
      "maxLevel": 6,
      "levelsDescriptions": [
        "You learn the basics of how the web works at a conceptual level.",
        "You learn the basics of HTML and CSS, for building a static website.",
        "You learn the basics of JavaScript, for building a interactive website.",
        "You learn about JS libraries and basic use of the package system.",
        "You learn how to debug using the DevTools of your browser.",
        "You learn how to make simple API calls and display content dynamically."
      ],
      "locked": false,
      "treeData": { "x": 0, "y": 0 },
      "origin": "class"
    },
    {
      "name": "Cloud Engineering Fundamentals",
      "description": "Learn the techniques of how to setup, manage the different cloud resources, at a basic level for a Cloud Provider of your choice.",
      "icon": "☁️",
      "prerequisites": [{ "name": "Programming Fundamentals", "level": 3 }],
      "level": 6,
      "maxLevel": 14,
      "levelsDescriptions": [
        "You learn the systems, resources and services of a Cloud Provider of your choice, between: AWS, Azure or GCP.",
        "You learn how to setup and manage the basics of Serverless Functions",
        "You learn how to setup and manage the basics of Apps",
        "You learn how to setup and manage the basics of File Storages",
        "You learn how to setup and manage the basics of Databases",
        "You learn how to setup and manage the basics of IAM, Secret Manager and RBAC",
        "You learn how to setup and manage the basics of API Gateways",
        "You learn how to setup and manage the basics of Containers and Orchestrators",
        "You learn how to setup and manage the basics of Virtual Machines",
        "You learn how to setup and manage the basics of Networking",
        "You learn how to setup and manage the basics of Monitoring and Logging",
        "You learn how to setup and manage the basics of CI/CD Pipelines",
        "You learn how to setup and manage the basics of Security",
        "You learn how to setup and manage the basics of Cost Management"
      ],
      "locked": false,
      "treeData": { "x": 0, "y": 0 },
      "origin": "class"
    },
    {
      "name": "Advanced DevOps",
      "description": "Learn the techniques of how to manage large scale applications reliably, using observability, containerization, orchestration and infrastructure management.",
      "icon": "🧑‍🔧",
      "prerequisites": [{ "name": "Cloud Engineering", "level": 1 }],
      "level": 0,
      "maxLevel": 3,
      "levelsDescriptions": [
        "You learn techniques of containerization, how to setup Docker Compose and how to deploy Containers.",
        "You learn techniques of orchestration, how to setup Kubernetes and how to deploy Pods.",
        "You learn how to setup your infrastructure as code using Terraform."
      ],
      "locked": true,
      "treeData": { "x": 0, "y": 0 },
      "origin": "class"
    }
  ],
  "savingThrows": {
    "wisdom": {
      "description": "Example: Holding focus and maintaining yourself rational under stressful situations.",
      "proficient": true
    },
    "intelligence": {
      "description": "Example: Resisting confusion from poorly documented legacy code, and debugging production errors.",
      "proficient": true
    },
    "charisma": {
      "description": "Example: Resisting the PO sweet talking you to underestimate the time to build a feature.",
      "proficient": false
    },
    "constitution": {
      "description": "Example: Keeping body flexibility, resisting back pain and tendonitis.",
      "proficient": false
    },
    "strength": {
      "description": "Example: Maintaining a good posture, after hours of sitting.",
      "proficient": false
    },
    "dexterity": {
      "description": "Example: Keeping a quick hand-eye coordination, when having to multitask through tabs of IDEs, test apps, logs, DBs, and the endless threads of people asking for different things.",
      "proficient": false
    }
  },
  "attributes": {
    "strength": {
      "label": "Strength",
      "shortLabel": "STR",
      "composition": {
        "Base": 8,
        "Attribute Leveling": 2
      }
    },
    "dexterity": {
      "label": "Dexterity",
      "shortLabel": "DEX",
      "composition": {
        "Base": 12,
        "Race Modifier - Carioca": 1
      }
    },
    "constitution": {
      "label": "Constitution",
      "shortLabel": "CON",
      "composition": {
        "Base": 14
      }
    },
    "intelligence": {
      "label": "Intelligence",
      "shortLabel": "INT",
      "composition": {
        "Base": 15,
        "Attribute Leveling": 2,
        "Race Modifier - Human": 1
      }
    },
    "wisdom": {
      "label": "Wisdom",
      "shortLabel": "WIS",
      "composition": {
        "Base": 13,
        "Race Modifier - Human": 1
      }
    },
    "charisma": {
      "label": "Charisma",
      "shortLabel": "CHA",
      "composition": {
        "Base": 10,
        "Race Modifier - Brazilian": 1
      }
    }
  },
  "health": {
    "max": 58,
    "current": 55
  },
  "inventory": {
    "weapons": [
      {
        "name": "Dell Inspiron 15 of Infinite Debugging",
        "subtype": "Laptop",
        "rarity": "uncommon",
        "stats": [
          "+20 Coding Speed",
          "+1 Bonus in Continuous Learning Skill",
          "-1 Bonus in Stress Management Skill"
        ],
        "description": "A unpromising laptop for web development activities that has been modified with the Ubuntu 20.04 set of OS runes.\n\nThis modification tortures its yielder into learning OS rituals he otherwise wouldn't have to, in order to solve issues that otherwise wouldn't happen.",
        "equipped": true,
        "icon": "💻"
      },
      {
        "name": "Arzopa Portable Screen of Enhanced Awareness",
        "subtype": "Portable Screen",
        "rarity": "common",
        "stats": ["+10 Coding Speed", "+1 Bonus in Perception Skill"],
        "description": "A light portable screen, handy for a nomadic Software Engineer. Increases Perception and reduces the chance of getting lost in tabs.",
        "equipped": true,
        "icon": "📺"
      }
    ],
    "equipments": [
      {
        "name": "Casual Clothes of Comfort",
        "subtype": "Light Armor",
        "rarity": "common",
        "stats": ["+20 Comfort", "-10 Style"],
        "description": "A comfortable set of clothes ideal for long rituals at home. It's usage in social settings can be frowned upon.",
        "equipped": true,
        "icon": "🩳"
      },
      {
        "name": "Minimalistic Social Garment of Fire Resistance",
        "subtype": "Light Armor",
        "rarity": "common",
        "stats": ["+10 Style", "+5 Comfort", "Reduces Fire Damage by 1d4"],
        "description": "The default armor for a non-formal office environment, made of breathable fabrics.",
        "equipped": false,
        "icon": "👕"
      },
      {
        "name": "Minimalistic Social Garment of Cold Resistance",
        "subtype": "Light Armor",
        "rarity": "common",
        "stats": ["+15 Style", "Reduces Cold Damage by 1d4"],
        "description": "The default armor for a non-formal office environment, made of heavy fabrics.",
        "equipped": false,
        "icon": "🧥"
      },
      {
        "name": "Superior Glasses of Miopia Suppression",
        "subtype": "Helmet",
        "rarity": "uncommon",
        "stats": ["+5 Style", "Immunity to Short-Sightedness"],
        "description": "It's made with a metal frame that that molds to the wearer's head shape, and its lenses are aspherical for reduced weight and removing eye-size distortions.\n\nPerfect glasses for someone born with the short-sightedness curse, can be used for long periods of time without sacrifing neither comfort nor style.",
        "equipped": true,
        "icon": "👓"
      }
    ]
  },
  "achievements": [
    {
      "name": "Performance Optimizer",
      "description": "Reduced app memory consumption from 1.6GB to 150MB and request durations by 95%",
      "icon": "⚡",
      "difficulty": "impossible",
      "dateEarned": "2024-10-15"
    },
    {
      "name": "Deployment Master",
      "description": "Reduced deployment time by 80% from 20 minutes to 4 minutes",
      "icon": "🚀",
      "difficulty": "expert",
      "dateEarned": "2023-08-15"
    },
    {
      "name": "Team Leader",
      "description": "Led team of four developers to 50-100% productivity increase",
      "icon": "👥",
      "difficulty": "hard",
      "dateEarned": "2024-09-01"
    },
    {
      "name": "Cost Saver",
      "description": "Saved USD 10,000 by reimplementing Excel-like spreadsheet solution",
      "icon": "💰",
      "difficulty": "expert",
      "dateEarned": "2023-06-20"
    },
    {
      "name": "Fast Learner",
      "description": "Completed internship 6 months early, bypassing entry-level position",
      "icon": "📚",
      "difficulty": "medium",
      "dateEarned": "2022-08-01"
    },
    {
      "name": "Bug Slayer",
      "description": "Earned recognition for resolving issues and bugs swiftly during internship",
      "icon": "⚔️",
      "difficulty": "easy",
      "dateEarned": "2022-06-01"
    }
  ],
  "questLog": {
    "completed": [
      {
        "name": "SWE @Suger",
        "place": "Suger (San Francisco, United States - Remote)",
        "description": "Planned and delivered features end-to-end: task planning, APIs and UIs, database changes, cloud connections, tests and documentation.\n\nBuilt and incremented reusable API integrations for Salesforce, HubSpot, NetSuite, Quickbooks, among others, so integrations were easier to build and customize.\n\nRan ten technical interviews: made and reviewed interview projects, interviewed candidates, wrote evaluations and participated in the hiring decision.\n\nOnboarded and mentored three engineers: discussed and clarified tasks and bugs, paired on code and reviewed pull requests to help them start contributing faster. Worked leading these engineers on the development of larger features from design to deployment.",
        "completionDate": "2025/07",
        "startDate": "2024/10",
        "icon": "🍩",
        "difficulty": "impossible",
        "rewards": [
          "Proficiency in: Typescript, Vue, Javascript, HTML, Tailwind CSS, CSS, Jest, Playwright, Golang, Postgres, AWS",
          "Experience with: Salesforce, HubSpot, NetSuite, Quickbooks integrations",
          "Leadership skills: Technical interviewing, mentoring, team management"
        ]
      },
      {
        "name": "SWE IV @Radix",
        "place": "Radix Engineering and Software (Rio de Janeiro, Brazil - Remote)",
        "description": "Optimized performance and usability of a Dashboard displaying industrial data with multiple charts containing hundreds of thousands of points each and a Web GL 3D view, using strategies like caching and lazy loading to bring memory consumption to a third of its value; request splitting and geometry filters to reduce request duration up to 95%; and pre-fetching to reduce feature loading from more than 10s to a fraction of a second.",
        "completionDate": "2024/10",
        "startDate": "2024/09",
        "icon": "🎄",
        "difficulty": "medium",
        "rewards": [
          "Proficiency in: Typescript, Next JS, React, Javascript, Tailwind CSS, CSS, HTML, GraphQL, ThreeJS",
          "Performance optimization: Memory management, caching strategies, request optimization"
        ]
      },
      {
        "name": "React Extract",
        "description": "Developed a VS Code extension for refactoring React components, with over 25 Github Stars on the repo, 2800 downloads and a 5/5 review grade on the VS Code Marketplace, praised by the community for fixing a problem that larger and more popular extensions could not.",
        "startDate": "2024/02",
        "completionDate": "2024/07",
        "icon": "💥",
        "difficulty": "medium",
        "rewards": [
          "Proficiency in: Javascript, Typescript, React, VS Code API, Typescript API, Mocha",
          "Experience in: Extension Development"
        ]
      },
      {
        "name": "SWE III @Radix",
        "place": "Radix Engineering and Software (Rio de Janeiro, Brazil - Remote)",
        "description": "Led the implementation of a new interactive 3D visualization of an oil refinery plant for increased data contextualization, having left stakeholders impressed by the MVP and wanting to expand its features.\n\nLed a team of four developers, providing tailored feedback to enhance performance, aiding in comprehension of requirements and their implications, fostering improved questioning, workflow organization, and continuous testing. Helped team members to achieve an estimated 50% to 100% increase in productivity, measured by reduced time for delivering user stories.",
        "startDate": "2023/08",
        "completionDate": "2024/09",
        "icon": "🌳",
        "difficulty": "medium",
        "rewards": [
          "Proficiency in: Typescript, React, Javascript, Tailwind CSS, CSS, HTML, ThreeJS, C#, .NET, MS SQL",
          "Team leadership skills"
        ]
      },
      {
        "name": "SWE II @Radix",
        "place": "Radix Engineering and Software (Rio de Janeiro, Brazil - Remote)",
        "description": "Reduced deployment time by 80% by creating deployment pipelines, reducing it from 20 minutes to 4 minutes on average on multiple on-premises virtual machines, thus enabling faster testing cycles and eliminating deployment errors.\n\nSaved an estimated amount of 200 hours in development time by reimplementing an Excel-like spreadsheet solution with a more feature-rich and compatible library.\n\nConsistently delivered user stories within 40% to 70% of allocated timeframes.",
        "startDate": "2022/08",
        "completionDate": "2023/08",
        "icon": "🪴",
        "difficulty": "medium",
        "rewards": [
          "Access to the Full Stack Subclass",
          "Proficiency in: Typescript, React, Javascript, CSS, HTML, Redux, C#, .NET, MS SQL, Azure DevOps"
        ]
      },
      {
        "name": "SWE Intern @Radix",
        "place": "Radix Engineering and Software (Rio de Janeiro, Brazil - Remote)",
        "description": "Learned an entire stack of web development technologies from scratch, earning recognition for fixing bugs swiftly.",
        "startDate": "2021/05",
        "completionDate": "2022/08",
        "icon": "🌱",
        "difficulty": "hard",
        "rewards": [
          "Access to the Software Engineer Class",
          "Proficiency in: Typescript, Angular, Javascript, CSS, SCSS, HTML, RxJS, C#, .NET, MS SQL, Postgres"
        ]
      },
      {
        "name": "Programmer Alchemist",
        "description": "Founded a minor Programming Guild inside the Alchemist Artificers' Guild, to teach fellow alumni the basics of programming for their craft experiments, using the Python rune set.",
        "startDate": "2021/03",
        "completionDate": "2021/08",
        "icon": "🧙",
        "difficulty": "easy",
        "rewards": [
          "Proficiency in: Python",
          "Experience in: Content Creation and Teaching"
        ]
      },
      {
        "name": "BSc in Chemical Engineering",
        "description": "Cleared all undergraduate level dungeons of the Alchemist Artificers' Guild, including but not limited to: Calculus, Physics, Thermodynamics, Kinetics, Fluid Mechanics, Heat and Mass Transfer, and Separation Processes. \n\nBonus points for clearing 1/3 of the dungeons during the COVID-19 patch, that brought global Constitution and Wisdom debuffs to all players, and for defeating the Thesis Final Boss without taking any hit.",
        "startDate": "2017/03",
        "completionDate": "2022/09",
        "icon": "🤪",
        "rewards": [
          "BSc in Chemical Engineering",
          "Unlocked path to become any of the Artificer or Wizard Classes",
          "Proficiency in: Python, Process Optimization, Scientific Computing"
        ],
        "difficulty": "expert"
      }
    ],
    "inProgress": [
      {
        "name": "Express Entry",
        "difficulty": "hard",
        "description": "Immigration to Canada via the Express Entry system. Had to surpass a mountain of paperwork, tests, validations, and interviews. Learned the French language from scratch to CEFR C1 level in order to qualify through the Francophone rounds of invitations.\n\nWith COPR (Confirmation of Permanent Residence) in hand, I just need to collect the rewards at the Canadian border.",
        "rewards": [
          "Full access to the Canadian Server",
          "Canadian Permanent Residency"
        ],
        "progress": 99,
        "estimatedCompletion": "2025/10",
        "startDate": "2023/11",
        "icon": "🍁"
      }
    ]
  },
  "contact": {
    "email": {
      "label": "Email",
      "link": "mailto:joaombn97@gmail.com",
      "iconName": "Mail"
    },
    "linkedin": {
      "label": "LinkedIn",
      "link": "https://www.linkedin.com/in/joaomarcosbatistanascimento",
      "iconName": "Linkedin"
    },
    "github": {
      "label": "GitHub",
      "link": "https://github.com/joao-mbn",
      "iconName": "Github"
    }
  }
}
