{
  "name": "João Nascimento",
  "race": {
    "species": {
      "primary": "Human",
      "effects": [
        "+1 to two Attributes of your choice",
        "You gain Proficiency in one skill of your choice"
      ],
      "description": "Humans are a blank slate, they can be anything they want to be."
    },
    "ethnicity": {
      "primary": "Brazilian",
      "effects": [
        "You gain Proficiency on Wisdom Saving Throws",
        "+1 Charisma",
        "You max the Portuguese language",
        "You gain 2 points in the Spanish language"
      ],
      "description": "In living in a country full of chaos, inefficiencies and conflicting ideas, Brazilians have developed a resilient mind and a way to carry on with their lives with humor and a good laugh in the face of adversity."
    },
    "archetype": {
      "primary": "Carioca",
      "effects": [
        "You gain Proficiency in Perception",
        "+1 Dexterity",
        "Resistance to Fire Damage",
        "Weakness to Cold Damage"
      ],
      "description": "Rio's violence creates almost a paranoid awareness of your surroundings, granting enhanced agility and defense reflexes.\n\nThe scorching heat of the city builds natural resistance to fire damage, while the lack of cold exposure makes you vulnerable to freezing temperatures."
    }
  },
  "birthDate": "1997-02-17",
  "experience": {
    "campaignStartDate": "2021-05-10",
    "experienceDescriptions": {
      "1": "A fledgling Code Initiate, you have just begun your journey into the arcane arts of programming. You still need guidance in all but the simplest of rituals, but your potential is boundless.",
      "5": "An Acolyte of the arcane arts of programming. You have the autonomy operate on others' rituals mostly unguided, but you still lack the ability to concoct your own. You excel best as a cog in the machine.",
      "10": "A Code Adept with considerable power at your fingertips. You can craft sophisticated applications, solve problems creatively and guide the younger in their rituals. Your runes are a thing of beauty, but you still lack the ability to create impact at scale.",
      "15": "An Archengineer whose mastery of the programming arts abounds and overflows. You can architect entire systems, lead teams of fellow casters, and your debugging prowess borders on divination. At this level you can masterly and effortlessly mimic, improve and create rituals of your own.",
      "20": "You're truly a legend. You can not only create entire systems, but acquire the wisdom to know which systems to create and why. You command entire armies of casters and have the influence the very runes with which to write."
    },
    "attributeLeveling": [4, 8, 12, 16],
    "proficiencyBonus": [
      2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5, 6, 6, 6, 6
    ]
  },
  "profession": {
    "name": "Software Engineer",
    "subclass": {
      "name": "Full Stack",
      "description": "Full Stack Software Engineers are the most versatile and well-rounded of all Software Engineers, knowledgeable in many of the different arcane arts of Software Development. \n\nHowever, their abilities fall short when it comes to design full-fledged complex systems operating at scale.\n\nThey're an excellent choice for small teams or teams that work on many different projects of lower complexity.",
      "effects": [
        "Choose 1 skill proficiency between: Continuous Learning, Intuition and Effective Communication",
        "For all these features, you can go up to level 3, if you haven't reached that level already: Backend Programming Language, Frontend Programming Language, SQL Fundamentals, Git, Cloud Platform."
      ]
    },
    "description": "Software Engineers bend reality by writing runes in a strange language over electrified rocks.\n\nTheir drink of choice for these long rituals is coffee, that has potentially dangerous effects on the uninitiated, but a fuel in the mouth of these conjurers. Their minds are forged by endless debugging and their bodies are hardened by prolonged sitting sessions.\n\nThis class gives little attention to armor and use little more than the most basic they can get away with. They generally wield Laptops as their weapon of choice, opting for Desktop PCs for bulkier builds. Inumerous builds are possible, leveraging a wide range of skills, from analytical, to creative and interpersonal.",
    "effects": [
      "Hit Die: d8",
      "Immunity to Caffeine",
      "You gain Proficiency on Intelligence Saving Throws",
      "You gain Proficiency in Light Armor",
      "You gain Proficiency in Laptops and Desktop PCs",
      "Choose 3 skill proficiencies between: Analytical Reasoning, Continuous Learning, Leadership, Attention to Detail, Artistic Expression and Strategic Planning.",
      "Subclass: Choose at Level 3 - Frontend, Backend, Full Stack, DevOps, Mobile, Embedded Systems, OS Development, Game Development, ML/AI or Engineering Management"
    ]
  },
  "alignment": "True Neutral",
  "portrait": "/placeholder.svg",
  "languages": [
    {
      "name": "Portuguese",
      "level": 7,
      "cefrLevel": "Native"
    },
    {
      "name": "English",
      "level": 6,
      "cefrLevel": "C2",
      "description": "Certified by the Imperial League of English Testing Scholars (IELTS) - Band 8.5 | CEFR C2 equivalent, credential 23BR000122BATJ705G"
    },
    {
      "name": "French",
      "level": 5,
      "cefrLevel": "C1",
      "description": "Certified by the Tribunal de Compétence Française (TCF) - CEFR C1, CREDENTIAL ID: 8D2CAB511C9D"
    },
    {
      "name": "German",
      "level": 4,
      "cefrLevel": "B2",
      "underusageDebuff": {
        "active": true,
        "description": "Underusage puts the user two levels of proficiency below its current, until he spends some time in the language to regain level."
      }
    },
    {
      "name": "Spanish",
      "level": 2,
      "cefrLevel": "A2",
      "description": "Can read basic and intermediate texts due to similarity with Portuguese.",
      "underusageDebuff": {
        "active": true,
        "description": "Underusage puts the user two levels of proficiency below its current, until he spends some time in the language to regain level."
      }
    }
  ],
  "immunities": ["Caffeine"],
  "resistances": ["Fire Damage"],
  "weaknesses": ["Cold Damage"],
  "weaponProficiencies": ["Laptops", "Desktop PCs"],
  "armorProficiencies": ["Light Armor"],
  "appearance": {
    "sex": "Male",
    "hair": "Black and wavy, extending up to the shoulders",
    "eyes": "Black",
    "skin": "Light brown",
    "height": "1.66m",
    "weight": "64kg"
  },
  "skills": [
    {
      "name": "Perception",
      "description": "Quickly noticing patterns, detecting changes in environment, and identifying what differs from the usual",
      "attribute": "wisdom",
      "proficient": true
    },
    {
      "name": "Intuition",
      "description": "Trusting gut instincts, making decisions with incomplete information, and suspending disbelief when facing the unknown",
      "attribute": "wisdom",
      "proficient": false
    },
    {
      "name": "Analytical Reasoning",
      "description": "Gathering information, analyzing data, questioning assumptions, and solving complex problems through research and logical thinking",
      "attribute": "intelligence",
      "proficient": true
    },
    {
      "name": "Persuasion",
      "description": "Ability to influence others through logical arguments, emotional appeals, and negotiation",
      "attribute": "charisma",
      "proficient": false
    },
    {
      "name": "Effective Communication",
      "description": "Understanding people's motives, communicating effectively, and building meaningful relationships",
      "attribute": "charisma",
      "proficient": true
    },
    {
      "name": "Continuous Learning",
      "description": "Staying current with technology trends, learning new tools and frameworks, and adapting to industry changes",
      "attribute": "intelligence",
      "proficient": true
    },
    {
      "name": "Artistic Expression",
      "description": "Creating beauty, expressing ideas through art, and appreciating aesthetic value in various forms",
      "attribute": "intelligence",
      "proficient": false
    },
    {
      "name": "Risk Taking",
      "description": "Embracing uncertainty, making bold decisions, and pursuing opportunities despite potential failure",
      "attribute": "wisdom",
      "proficient": false
    },
    {
      "name": "Strategic Planning",
      "description": "Creating long-term plans, designing systems, and managing complex projects with foresight",
      "attribute": "intelligence",
      "proficient": true
    },
    {
      "name": "Leadership",
      "description": "Inspiring and guiding others, making decisions, and taking responsibility for outcomes",
      "attribute": "charisma",
      "proficient": false
    },
    {
      "name": "Empathy",
      "description": "Understanding and sharing the feelings of others, building rapport and trust",
      "attribute": "charisma",
      "proficient": false
    },
    {
      "name": "Attention to Detail",
      "description": "Noticing small errors, maintaining quality standards, and ensuring accuracy",
      "attribute": "wisdom",
      "proficient": true
    },
    {
      "name": "Physical Endurance",
      "description": "Maintaining energy and focus during long work sessions, handling physical demands",
      "attribute": "strength",
      "proficient": false
    },
    {
      "name": "Manual Precision",
      "description": "Performing precise physical tasks, fine motor control, and delicate operations",
      "attribute": "dexterity",
      "proficient": false
    },
    {
      "name": "Physical Coordination",
      "description": "Moving efficiently in workspace, handling equipment, and maintaining good posture",
      "attribute": "dexterity",
      "proficient": false
    },
    {
      "name": "Stress Management",
      "description": "Maintaining composure under pressure, managing emotions, and staying focused",
      "attribute": "wisdom",
      "proficient": false
    },
    {
      "name": "Networking",
      "description": "Building professional relationships, expanding contacts, and leveraging connections",
      "attribute": "charisma",
      "proficient": false
    }
  ],
  "savingThrows": {
    "wisdom": {
      "description": "Example: Keeping focus and maintaining yourself rational at attempts of manipulation, or under stressful situations, pressure and even abusive environments.",
      "proficient": true
    },
    "intelligence": {
      "description": "Example: Resisting confusion from poorly documented legacy code, and debugging production errors.",
      "proficient": true
    },
    "charisma": {
      "description": "Example: Resisting peer pressure to adopt trendy but unsuitable technologies, maintaining composure during code reviews, and avoiding the charm of technical debt disguised as 'quick fixes'.",
      "proficient": false
    },
    "constitution": {
      "description": "Example: Keeping body flexibility, resisting back pain and tendonitis.",
      "proficient": false
    },
    "strength": {
      "description": "Example: Maintaining a good posture, after hours of sitting.",
      "proficient": false
    },
    "dexterity": {
      "description": "Example: Keeping a quick hand-eye coordination, when having to multitask through tabs of IDEs, test apps, logs, DBs, and the endless threads of people asking for different things.",
      "proficient": false
    }
  },
  "attributes": {
    "strength": {
      "label": "Strength",
      "shortLabel": "STR",
      "composition": {
        "Base": 8,
        "Attribute Leveling": 2
      }
    },
    "dexterity": {
      "label": "Dexterity",
      "shortLabel": "DEX",
      "composition": {
        "Base": 12,
        "Race Modifier - Carioca": 1
      }
    },
    "constitution": {
      "label": "Constitution",
      "shortLabel": "CON",
      "composition": {
        "Base": 14
      }
    },
    "intelligence": {
      "label": "Intelligence",
      "shortLabel": "INT",
      "composition": {
        "Base": 15,
        "Attribute Leveling": 2,
        "Race Modifier - Human": 1
      }
    },
    "wisdom": {
      "label": "Wisdom",
      "shortLabel": "WIS",
      "composition": {
        "Base": 13,
        "Race Modifier - Human": 1
      }
    },
    "charisma": {
      "label": "Charisma",
      "shortLabel": "CHA",
      "composition": {
        "Base": 10,
        "Race Modifier - Brazilian": 1
      }
    }
  },
  "health": {
    "max": 58,
    "current": 58
  },
  "inventory": {
    "weapons": [
      {
        "name": "Legendary MacBook Pro of Swift Development",
        "type": "Primary Weapon",
        "rarity": "Legendary",
        "stats": "+20 Coding Speed, +15 Problem Solving",
        "description": "A mystical device that responds to João's natural problem-solving instincts"
      },
      {
        "name": "Mechanical Keyboard of Devil's Advocacy",
        "type": "Weapon Enhancement",
        "rarity": "Epic",
        "stats": "+25 Critical Thinking, +10 Debate Power",
        "description": "Each keystroke echoes with the power of challenging assumptions"
      }
    ],
    "armor": [
      {
        "name": "Fast Learning Helm of Adaptation",
        "type": "Head Armor",
        "rarity": "Rare",
        "stats": "+30 Learning Speed, +20 Problem Solving",
        "description": "Forged from years of rapid knowledge absorption and adaptation"
      },
      {
        "name": "Performance Optimization Gauntlets",
        "type": "Hand Protection",
        "rarity": "Epic",
        "stats": "+40 Memory Optimization, +25 Speed Enhancement",
        "description": "Reduces app memory consumption from 1.6GB to 150MB"
      }
    ],
    "consumables": [
      {
        "name": "Fast Learning Elixir",
        "type": "Consumable",
        "quantity": "∞",
        "effect": "+50 Learning Speed, +25 Adaptation for 8 hours",
        "description": "The essence of João's most powerful ability - rapid knowledge absorption"
      },
      {
        "name": "Devil's Advocate Scroll",
        "type": "Knowledge Item",
        "quantity": "∞",
        "effect": "Instantly identifies flaws in any argument or system design",
        "description": "Ancient wisdom passed down through generations of critical thinkers"
      }
    ],
    "tools": [
      {
        "name": "VS Code of Infinite Extensions",
        "type": "IDE",
        "rarity": "Legendary",
        "description": "The ultimate weapon for code manipulation and rapid development"
      },
      {
        "name": "Git Repository of Time Travel",
        "type": "Version Control",
        "rarity": "Epic",
        "description": "Allows traversal through the timeline of code with deployment pipelines"
      },
      {
        "name": "Docker Container of Isolation",
        "type": "Environment Tool",
        "rarity": "Rare",
        "description": "Creates pocket dimensions for applications and deployment efficiency"
      },
      {
        "name": "Three.js Staff of 3D Visualization",
        "type": "Specialized Tool",
        "rarity": "Epic",
        "description": "Wields the power of interactive 3D visualization for industrial data"
      }
    ]
  },
  "achievements": [
    {
      "name": "Performance Optimizer",
      "description": "Reduced app memory consumption from 1.6GB to 150MB and request durations by 95%",
      "icon": "⚡",
      "rarity": "Legendary",
      "dateEarned": "2024-10-15"
    },
    {
      "name": "Deployment Master",
      "description": "Reduced deployment time by 80% from 20 minutes to 4 minutes",
      "icon": "🚀",
      "rarity": "Epic",
      "dateEarned": "2023-08-15"
    },
    {
      "name": "Team Leader",
      "description": "Led team of four developers to 50-100% productivity increase",
      "icon": "👥",
      "rarity": "Rare",
      "dateEarned": "2024-09-01"
    },
    {
      "name": "Cost Saver",
      "description": "Saved USD 10,000 by reimplementing Excel-like spreadsheet solution",
      "icon": "💰",
      "rarity": "Epic",
      "dateEarned": "2023-06-20"
    },
    {
      "name": "Fast Learner",
      "description": "Completed internship 6 months early, bypassing entry-level position",
      "icon": "📚",
      "rarity": "Rare",
      "dateEarned": "2022-08-01"
    },
    {
      "name": "Bug Slayer",
      "description": "Earned recognition for resolving issues and bugs swiftly during internship",
      "icon": "⚔️",
      "rarity": "Uncommon",
      "dateEarned": "2022-06-01"
    }
  ],
  "background": {
    "story": "Born with an innate ability to question everything and learn at lightning speed, João discovered his calling as a natural problem solver and Devil's Advocate. With 4 years mastering the arcane arts of web development, he has risen from a self-taught developer to a formidable Software Engineer. His journey began in the mystical realm of Radix Engineering, where he learned web development technologies from scratch and completed his internship six months ahead of schedule. Now, he wields the power of multiple programming languages and frameworks, capable of optimizing performance by 95% and leading teams to achieve 50-100% productivity increases.",
    "ideals": [
      "Question everything - the best solutions come from challenging assumptions",
      "Learn fast, adapt faster - knowledge is the ultimate weapon",
      "Optimize relentlessly - every second and byte matters"
    ],
    "bonds": [
      "Mentor to newer engineers, helping them navigate the codebase labyrinth",
      "Guardian of performance optimization and deployment efficiency",
      "Sworn protector of clean, maintainable code"
    ],
    "flaws": [
      "Cannot resist playing Devil's Advocate, even when it's not needed",
      "Sometimes gets lost in the pursuit of perfect optimization",
      "Weak against legacy systems that resist modernization"
    ]
  },
  "questLog": {
    "completed": [
      {
        "name": "The Great Performance Optimization",
        "difficulty": "Legendary",
        "description": "Optimized Dashboard performance with multiple charts containing hundreds of thousands of points and WebGL 3D view, reducing memory consumption by 75% and request durations by 95%",
        "reward": "+500 XP, Performance Optimizer Achievement",
        "company": "Radix Engineering and Software"
      },
      {
        "name": "The 3D Visualization Quest",
        "difficulty": "Epic",
        "description": "Led implementation of interactive 3D visualization of oil refinery plant, impressing stakeholders and expanding features",
        "reward": "+400 XP, Team Leader Achievement",
        "company": "Radix Engineering and Software"
      },
      {
        "name": "The Deployment Pipeline Saga",
        "difficulty": "Epic",
        "description": "Created deployment pipelines reducing deployment time by 80% from 20 minutes to 4 minutes on multiple on-premises VMs",
        "reward": "+350 XP, Deployment Master Achievement",
        "company": "Radix Engineering and Software"
      },
      {
        "name": "The Spreadsheet Revolution",
        "difficulty": "Rare",
        "description": "Reimplemented Excel-like spreadsheet solution with more feature-rich library, saving USD 10,000 in development time",
        "reward": "+300 XP, Cost Saver Achievement",
        "company": "Radix Engineering and Software"
      },
      {
        "name": "The Internship Acceleration",
        "difficulty": "Rare",
        "description": "Completed software development internship 6 months ahead of schedule, securing Developer II position",
        "reward": "+250 XP, Fast Learner Achievement",
        "company": "Radix Engineering and Software"
      }
    ],
    "inProgress": [
      {
        "name": "The API Integration Epic",
        "difficulty": "Epic",
        "description": "Planning, designing, implementing and testing API integrations with multiple 3rd party systems (Salesforce, Hubspot, Netsuite, QBO)",
        "progress": 75,
        "estimatedCompletion": "Q1 2025"
      },
      {
        "name": "The Technical Interview Mastery",
        "difficulty": "Rare",
        "description": "Conducting technical interviews, creating and reviewing interview projects, evaluating candidates",
        "progress": 90,
        "estimatedCompletion": "Q4 2024"
      }
    ]
  },
  "contact": {
    "email": {
      "label": "Email",
      "link": "mailto:joaombn97@gmail.com",
      "iconName": "Mail"
    },
    "linkedin": {
      "label": "LinkedIn",
      "link": "https://www.linkedin.com/in/joaomarcosbatistanascimento",
      "iconName": "Linkedin"
    },
    "github": {
      "label": "GitHub",
      "link": "https://github.com/joao-mbn",
      "iconName": "Github"
    }
  },
  "skillTree": {
    "nodes": [
      {
        "id": "problem-solving",
        "name": "Natural Problem Solving",
        "description": "Innate ability to question everything and find optimal solutions",
        "level": 10,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": [],
        "x": 400,
        "y": 50,
        "category": "foundation"
      },
      {
        "id": "fast-learning",
        "name": "Fast Learning",
        "description": "Mastery of rapid knowledge absorption and adaptation",
        "level": 10,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": [],
        "x": 600,
        "y": 50,
        "category": "foundation"
      },
      {
        "id": "web-development",
        "name": "Web Development",
        "description": "4 years of experience in modern web technologies",
        "level": 8,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["fast-learning"],
        "x": 600,
        "y": 150,
        "category": "specialization"
      },
      {
        "id": "typescript",
        "name": "TypeScript",
        "description": "Type-safe development across multiple frameworks",
        "level": 8,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["web-development"],
        "x": 600,
        "y": 250,
        "category": "specialization"
      },
      {
        "id": "react",
        "name": "React",
        "description": "Component-based UI development and optimization",
        "level": 8,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["typescript"],
        "x": 500,
        "y": 350,
        "category": "advanced"
      },
      {
        "id": "vue",
        "name": "Vue",
        "description": "Progressive frontend framework mastery",
        "level": 7,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["typescript"],
        "x": 700,
        "y": 350,
        "category": "advanced"
      },
      {
        "id": "angular",
        "name": "Angular",
        "description": "Full-featured frontend framework experience",
        "level": 6,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["typescript"],
        "x": 300,
        "y": 350,
        "category": "advanced"
      },
      {
        "id": "nextjs",
        "name": "Next.js",
        "description": "React framework for production applications",
        "level": 8,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["react"],
        "x": 500,
        "y": 450,
        "category": "advanced"
      },
      {
        "id": "threejs",
        "name": "Three.js",
        "description": "3D visualization and WebGL mastery",
        "level": 8,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["react"],
        "x": 400,
        "y": 550,
        "category": "mastery"
      },
      {
        "id": "golang",
        "name": "Golang",
        "description": "Backend development and API integration",
        "level": 7,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["web-development"],
        "x": 800,
        "y": 250,
        "category": "specialization"
      },
      {
        "id": "n8n",
        "name": "n8n",
        "description": "Workflow automation and integration",
        "level": 6,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["golang"],
        "x": 800,
        "y": 350,
        "category": "advanced"
      },
      {
        "id": "aws",
        "name": "AWS",
        "description": "Cloud platform services and deployment",
        "level": 7,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["web-development"],
        "x": 900,
        "y": 250,
        "category": "mastery"
      },
      {
        "id": "ai",
        "name": "AI Integration",
        "description": "Machine learning and AI system integration",
        "level": 6,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["web-development"],
        "x": 200,
        "y": 250,
        "category": "advanced"
      },
      {
        "id": "sql",
        "name": "SQL",
        "description": "Database query language and optimization",
        "level": 8,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["web-development"],
        "x": 700,
        "y": 450,
        "category": "advanced"
      },
      {
        "id": "git",
        "name": "Git",
        "description": "Version control and collaboration",
        "level": 9,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["web-development"],
        "x": 600,
        "y": 550,
        "category": "mastery"
      },
      {
        "id": "cicd",
        "name": "CI/CD",
        "description": "Continuous integration and deployment pipelines",
        "level": 8,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["git"],
        "x": 700,
        "y": 550,
        "category": "mastery"
      },
      {
        "id": "team-leadership",
        "name": "Team Leadership",
        "description": "Leading teams and mentoring developers",
        "level": 7,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["problem-solving"],
        "x": 100,
        "y": 350,
        "category": "mastery"
      },
      {
        "id": "technical-interviews",
        "name": "Technical Interviews",
        "description": "Conducting interviews and evaluating candidates",
        "level": 6,
        "maxLevel": 10,
        "unlocked": true,
        "prerequisites": ["team-leadership"],
        "x": 100,
        "y": 450,
        "category": "mastery"
      }
    ],
    "connections": [
      { "from": "problem-solving", "to": "team-leadership" },
      { "from": "fast-learning", "to": "web-development" },

      { "from": "web-development", "to": "typescript" },
      { "from": "web-development", "to": "golang" },
      { "from": "web-development", "to": "aws" },
      { "from": "web-development", "to": "sql" },
      { "from": "web-development", "to": "git" },
      { "from": "web-development", "to": "ai" },

      { "from": "typescript", "to": "react" },
      { "from": "typescript", "to": "vue" },
      { "from": "typescript", "to": "angular" },
      { "from": "golang", "to": "n8n" },

      { "from": "react", "to": "nextjs" },
      { "from": "react", "to": "threejs" },
      { "from": "git", "to": "cicd" },
      { "from": "team-leadership", "to": "technical-interviews" }
    ]
  }
}
